# Dt: 22/04/2025
# Exploratory Data Analysis

# Trial for Got Hub

In [ ]:
- 4 important packages or modules available

- Pandas

    - For Data Frame Operations

- Numpy

    - Numerical operations

- matplotlib

    -for plotting

- seaborn

    - for plotting

In [ ]:
================================EDA================================
1) Pandas                                   :   Data Frame operations
2) numpy                                    :   math operations
3) matplotlib                               :  plotting or Graph
4) seaborn                                  :  plotting or Graph
5) plotly                                   :  plotting or Graph
6) bokhe                                    :  plotting or Graph

================================Machine Learning================================
7) sickit- learn (sklearn)                  : for all ML algotithms
8) stats                                    : some statistical operations

================================Deep Learning================================
9) Tensor Flow                              : Deep learning models (Google)
10) keras                                   : Deep learning models models tensor flow as backend
11) pytorch                                 : Deep learning models (Meta)
12) Opencv                                  : For image and video operations
13) Pillow                                  : for image operations

================================Object Detection models (transfer learning)================================
14) Mobilenet                               : Deep learning packages
15) VGGnet                                  : Deep learning packages
16) Resnet                                  : Deep learning packages
17) Inceptionv3                             : Deep learning packages
18) YOLO                                    : Deep learning packages

================================ Natural Language Processing ================================
19) NLTK                                    : Natural Language Tool Kit
20) SpCy                                    : Alternative to NLTK
21) Wordcloud                               : Text representation

================================ NLP Word Embedding Models ================================
22) Word2Vec                                : Google
23) GloVe                                   : Stanford
24) Fasttext                                : Meta(Facebook)

================================ ALLEN NLP (Organisation) ================================
25) NLP applications                        : Pyspark as Backend

================================ Optical character Recognisation ================================
Extract the Text from the image
26) Tesseract
27) easyocr

========================================= BERT ===================================================
BERT: Bi directional Encoded representations from Transformers
28) Transformers                            : Hugging face (Taken over by Google)

================================ ALLEN NLP (Organisation) ================================
29) SQLITE                                  : Connect the database using Python
30) Selenium
31) Beautiful soup
32) Regex

================================ GenAI and LLM ================================
33) Langchain                               : To connect all LLM Models
34) GPT                                     : OpenAI
35) Gemini                                  : Google
36) Llama                                   : Meta
37) Grok                                    : XAi
38) BedRock                                 : Amazon
39) ClaudeAI                                : Anthropic

================================ Agentic AI ================================
40) Langraph
41) CrewAI
42) Phidata
43) Autogen

================================ API creation ================================
44) Flask
45) FastAPI
46) Gradio
47) Django

================================ Web Applications ================================
48) Streamlit

================================ Model deployment ================================
49) mlflow
50) Kubeflow

================================ Cloud AI ================================
51) Azure Cognitive services
52) Azure ML Studio
53) GCP vertexAI
54) AWS Sagemaker

================================ Extra ================================
55) random
56) time
57) math
58) logging
59) warnings
60) date

**Step-1: Import Packages**

In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create a Dataframe using List**

In [7]:
names = ['Ramesh', 'Suresh','Mahesh']
age = [20,21,22]
city= ['Tirupati', 'Banglore', 'Hyderabad']
pd.DataFrame(zip(names,age,city))

        0   1         2
0  Ramesh  20  Tirupati
1  Suresh  21  Banglore
2  Mahesh  22  yderabad

**Step-3: Insert the Columns**

In [2]:
import pandas as pd
names = ['Ramesh', 'Suresh','Mahesh']
age = [20,21,22]
city= ['Tirupati', 'Banglore', 'Hyderabad']
cols = ['Names','Age','City']
pd.DataFrame(zip(names,age,city), columns = cols)

    Names  Age       City
0  Ramesh   20   Tirupati
1  Suresh   21   Banglore
2  Mahesh   22  Hyderabad

**Step-4: Modify the Index**

In [14]:
names = ['Ramesh', 'Suresh','Mahesh']
age = [20,21,22]
city= ['Tirupati', 'Banglore', 'Hyderabad']
cols = ['Names','Age','City']
idx = ['A','B','C']
pd.DataFrame(zip(names,age,city), columns = cols, index =idx)

    Names  Age       City
A  Ramesh   20   Tirupati
B  Suresh   21   Banglore
C  Mahesh   22  Hyderabad

In [19]:
names = ['Ramesh','Suresh','Mahesh']
age = [25,35,45]
city = ['Tirupati','Chennai', 'Hyderabad']
cols = ['Name','Age','City']
idx = ['A','B','C']
df1=pd.DataFrame(zip(names,age,city),columns=cols, index=idx)

In [35]:
type(df1)

pandas.core.frame.DataFrame

- Index length , columns length should match with  No. of columns

**Step-5: Create dataframe using Dictionary**

In [26]:
d={'Names' : ['Ramesh','Suresh','Mahesh'],
   'Age' : [25,35,45],
   'City' : ['Tirupati','Chennai', 'Hyderabad']}
pd.DataFrame(d)

    Names  Age       City
0  Ramesh   25   Tirupati
1  Suresh   35    Chennai
2  Mahesh   45  Hyderabad

**Step-6:``Create Dataframe using scalar values**

In [32]:
d={'Names' : 'Ramesh',
   'Age' : 35,
   'City' : 'Tirupati'}
pd.DataFrame(d, index=[1,2,3])

    Names  Age      City
1  Ramesh   35  Tirupati
2  Ramesh   35  Tirupati
3  Ramesh   35  Tirupati

**Step-7: Data quick checks**

- shape

- size

- len

- columns

- dtypes

In [37]:
df1.shape

(3, 3)

In [38]:
df1.size

9

In [44]:
len(df1)

3

In [42]:
df1.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [43]:
df1.dtypes

Name    object
Age      int64
City    object
dtype: object

In [7]:
# practice

names = ['Ramesh', 'Suresh','Mahesh']
age = [20,21,22]
city= ['Tirupati', 'Banglore', 'Hyderabad']
col = ['Name', 'Age','City']
idx = [1,2,3]
pd.DataFrame(zip(names,age,city), columns = col, index = idx )

     Name  Age       City
1  Ramesh   20   Tirupati
2  Suresh   21   Banglore
3  Mahesh   22  Hyderabad

**Step-8 : Add Data to empty dataframe**

In [4]:
d1 = pd.DataFrame()
d1['Names']= ['Ramesh','Suresh','Mahesh']
d1['Age'] = [20,21,22]
d1['City'] = ['Tirupati','Banglore','Hyderabad']
d1

    Names  Age       City
0  Ramesh   20   Tirupati
1  Suresh   21   Banglore
2  Mahesh   22  Hyderabad

**Step-9: Add data to existing data file**

In [5]:
d1['Marks'] = [95,98,93]
d1

    Names  Age       City  Marks
0  Ramesh   20   Tirupati     95
1  Suresh   21   Banglore     98
2  Mahesh   22  Hyderabad     93

**Step-10: How to update the column values**

- if you want to add the new column to empty data frame

- if you want to add the new column to already existed dataframe

- if you want to modify the data of specific column

- The syntax is same

- df[col_name] = [data]

In [6]:
d1['City'] = ['Chennai','Banglore','Hyderabad']
d1['city'] = ['Chennai','Banglore','Hyderabad']
d1

    Names  Age       City  Marks       city
0  Ramesh   20    Chennai     95    Chennai
1  Suresh   21   Banglore     98   Banglore
2  Mahesh   22  Hyderabad     93  Hyderabad

**Step-11: How to drop specific column**

- by default axis =0 represents index
  
- if you provide the column change axis = 1

- inplace = True, DataFrame will be over write

In [7]:
d1.drop('city',axis=1,inplace=True)

In [8]:
d1

    Names  Age       City  Marks
0  Ramesh   20    Chennai     95
1  Suresh   21   Banglore     98
2  Mahesh   22  Hyderabad     93

In [25]:
d1['age'] = [25,35,45]
d1

    Names  Age       City  Marks  age
0  Ramesh   20    Chennai     95   25
1  Suresh   21   Banglore     98   35
2  Mahesh   22  Hyderabad     93   45

In [26]:
d1.drop(columns='age', inplace=True)

In [27]:
d1

    Names  Age       City  Marks
0  Ramesh   20    Chennai     95
1  Suresh   21   Banglore     98
2  Mahesh   22  Hyderabad     93

In [9]:
d1['city'] = ['chennai', 'blore','hyd']
d1['name'] = ['rams','suresh','mah']
d1

    Names  Age       City  Marks     city    name
0  Ramesh   20    Chennai     95  chennai    rams
1  Suresh   21   Banglore     98    blore  suresh
2  Mahesh   22  Hyderabad     93      hyd     mah

In [11]:
d1.drop(['city','name'],axis=1)

    Names  Age       City  Marks
0  Ramesh   20    Chennai     95
1  Suresh   21   Banglore     98
2  Mahesh   22  Hyderabad     93

In [13]:
d1

    Names  Age       City  Marks     city    name
0  Ramesh   20    Chennai     95  chennai    rams
1  Suresh   21   Banglore     98    blore  suresh
2  Mahesh   22  Hyderabad     93      hyd     mah

In [15]:
d1.drop(columns=['city','name'])

    Names  Age       City  Marks
0  Ramesh   20    Chennai     95
1  Suresh   21   Banglore     98
2  Mahesh   22  Hyderabad     93

**Step-12: Rename the column**

- Create a dictionary

- Key as old name, value as new name

In [16]:
d1

    Names  Age       City  Marks     city    name
0  Ramesh   20    Chennai     95  chennai    rams
1  Suresh   21   Banglore     98    blore  suresh
2  Mahesh   22  Hyderabad     93      hyd     mah

In [17]:
dict1= {'Marks':'Score'}
d1.rename(dict1,axis=1)

    Names  Age       City  Score     city    name
0  Ramesh   20    Chennai     95  chennai    rams
1  Suresh   21   Banglore     98    blore  suresh
2  Mahesh   22  Hyderabad     93      hyd     mah

In [55]:
dict1= {'Marks':'Score'}
d1.rename(columns=dict1)

    Names  Age       City  Score     city   names    name
0  Ramesh   20    Chennai     95  chennai    rams    rams
1  Suresh   21   Banglore     98    blore  suresh  suresh
2  Mahesh   22  Hyderabad     93      hyd     mah     mah

In [60]:
d1.drop(['city','names','city'], axis=1, inplace=True)

In [61]:
d1

    Names  Age       City  Marks    name
0  Ramesh   20    Chennai     95    rams
1  Suresh   21   Banglore     98  suresh
2  Mahesh   22  Hyderabad     93     mah

In [62]:
d1.drop(['name'],axis=1, inplace=True)

In [63]:
d1

    Names  Age       City  Marks
0  Ramesh   20    Chennai     95
1  Suresh   21   Banglore     98
2  Mahesh   22  Hyderabad     93

**Step-13: To Change all the columns**

In [64]:
d1.columns=['names','age','city','marks']

In [65]:
d1

    names  age       city  marks
0  Ramesh   20    Chennai     95
1  Suresh   21   Banglore     98
2  Mahesh   22  Hyderabad     93

In [68]:
d1.index = ['A','B','C']

In [69]:
d1

    names  age       city  marks
A  Ramesh   20    Chennai     95
B  Suresh   21   Banglore     98
C  Mahesh   22  Hyderabad     93

**Step-14: To Delete a Row**

In [82]:
d1.drop(['A'])

    names  age       city  marks
B  Suresh   21   Banglore     98
C  Mahesh   22  Hyderabad     93

In [83]:
d1

    names  age       city  marks
A  Ramesh   20    Chennai     95
B  Suresh   21   Banglore     98
C  Mahesh   22  Hyderabad     93

**Step-15: Add a new Row**

In [ ]:
d1[<col name>] = [v1,v2,v3]
d1.loc[<index>] = [data]

In [85]:
d1.loc['D']=['Harish', 23, 'Delhi',92]

In [86]:
d1

    names  age       city  marks
A  Ramesh   20    Chennai     95
B  Suresh   21   Banglore     98
C  Mahesh   22  Hyderabad     93
D  Harish   23      Delhi     92

**Step:16- Save the Data Frame**

In [87]:
d1

    names  age       city  marks
A  Ramesh   20    Chennai     95
B  Suresh   21   Banglore     98
C  Mahesh   22  Hyderabad     93
D  Harish   23      Delhi     92

In [93]:
d1.to_csv('data1.csv',index=False)

In [95]:
d1.to_excel('data.xlsx' )

**Step:17- Read the dataframe**

In [94]:
pd.read_csv('data1.csv')

    names  age       city  marks
0  Ramesh   20    Chennai     95
1  Suresh   21   Banglore     98
2  Mahesh   22  Hyderabad     93
3  Harish   23      Delhi     92

In [99]:
pd.read_excel('data.xlsx')

  Unnamed: 0   names  age       city  marks
0          A  Ramesh   20    Chennai     95
1          B  Suresh   21   Banglore     98
2          C  Mahesh   22  Hyderabad     93
3          D  Harish   23      Delhi     92

In [103]:
pd.read_csv(r'C:\Users\Acer\OneDrive\Data Science\Data Analysis\Numpy\Visadataset.csv')

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [106]:
pd.read_csv(r"C:\Users\Acer\OneDrive\Data Science\Data Analysis\Numpy\bank.csv")

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]